import 'package:intl/intl.dart';
import 'package:zekr/model/zekr.dart';

class Data {
  DateTime now = DateTime.now();
  var formatter = DateFormat('dd-MM-yyyy');
  List<Zekr> zekrGroup = [
    Zekr(
        z: " أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\n﴿ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾",
        c: 0,
        a: "1.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ هُوَ ٱللَّهُ أَحَدٌ ۝١ ٱللَّهُ ٱلصَّمَدُ ۝٢ لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ ۝٣ وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ ۝٤﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "112.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ۝١ مِن شَرِّ مَا خَلَقَ ۝٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝٣ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ ۝٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ۝٥﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "113.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ۝١ مَلِكِ ٱلنَّاسِ ۝٢ إِلَٰهِ ٱلنَّاسِ ۝٣ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ۝٤ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ۝٥ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ۝٦﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "114.mp3"),
    Zekr(
        z: " أَصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه ، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُبِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر ، رَبِّ أَعوذُبِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر",
        c: 0,
        a: "2.mp3"),
    Zekr(
        z: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور",
        c: 0,
        a: "3.mp3"),
    Zekr(
        z: " اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
        c: 0,
        a: "4.mp3"),
    Zekr(
        z: "اللهم إني أصبحتُ أُشهدكَ وأُشهدُ حملةَ عرشك وملائكتكَ وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عَبدٌكَ ورسولك\n\n(اربع مرات)",
        c: 4,
        a: "5.mp3"),
    Zekr(
        z: "اللَّهمَّ ما أصبحَ بي من نِعمةٍ أو بأحدٍ من خلقِك فمنكَ وحدَك، لا شريكَ لَك، فلَك الحمدُ، ولَك الشُّكرُ",
        c: 0,
        a: "6.mp3"),
    Zekr(
        z: "اللَّهمَّ عافِني في بدَني اللَّهمَّ عافِني في سمعي اللَّهمَّ عافِني في بصري لا إلهَ إلَّا أنت، اللَّهمَّ إنِّي أعوذُ بِكَ منَ الكُفْرِ والفقرِ اللَّهمَّ إنِّي أعوذُ بكَ من عذابِ القبرِ لا إلهَ إلَّا أنت\n\n(ثلاث مرات)",
        c: 3,
        a: "7.mp3"),
    Zekr(
        z: "حسبي الله لا إله إلا هو، عليه توكلت وهو رب العرش العظيم\n\n(سبع مرات)",
        c: 7,
        a: "8.mp3"),
    Zekr(
        z: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ استُرْ عَوْرَاتي، وآمِنْ رَوْعَاتي، اللَّهمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، ومِنْ خَلْفي، وَعن يَميني، وعن شِمالي، ومِن فَوْقِي، وأعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحتي",
        c: 0,
        a: "9.mp3"),
    Zekr(
        z: "اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّموَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلِيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءاً، أوْ أجُرَّهُ إلَى مُسْلِمٍ",
        c: 0,
        a: "10.mp3"),
    Zekr(
        z: "بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولا في السَّماءِ وَهوَ السَّميعُ العليمُ\n\n(ثلاث مرات)",
        c: 3,
        a: "11.mp3"),
    Zekr(
        z: "رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد نبيًا\n\n(ثلاث مرات)",
        c: 3,
        a: "12.mp3"),
    Zekr(
        z: "يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
        c: 0,
        a: "13.mp3"),
    Zekr(
        z: "أصبحنا وأصبح الملك لله رب العالمين، اللهم إني أسألك خير هذا اليوم: فتحه، ونصره، ونوره، وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده",
        c: 0,
        a: "14.mp3"),
    Zekr(
        z: "أصبحنا على فطرة الإسلام، وعلي كلمة الإخلاص، وعلي دين نبينا محمدٍ ﷺ، وعلي ملّة أبينا إبراهيم حنيفًا مسلمًاو ما كان من المشركين",
        c: 0,
        a: "15.mp3"),
    Zekr(z: "سبحان الله وبحمده\n\n(مائة مرة)", c: 100, a: "16.mp3"),
    Zekr(
        z: "لا إلهَ إلاَّ اللَّه وحْدهُ لاَ شَرِيكَ لهُ، لَهُ المُلْكُ، ولَهُ الحمْدُ، وَهُو عَلَى كُلِّ شَيءٍ قَدِيرٌ\n\n(مائة مرة)",
        c: 100,
        a: "17.mp3"),
    Zekr(
        z: "سبحان الله وبحمده، عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته\n\n(ثلاث مرات)",
        c: 3,
        a: "18.mp3"),
    Zekr(
        z: "اللَّهمَّ إنِّي أسأَلُكَ عِلمًا نافعًا، ورِزْقًا طيِّبًا، وعمَلًا مُتقَبَّلًا",
        c: 0,
        a: "19.mp3"),
    Zekr(z: "أستغفر الله وأتوب إليه\n\n(مائة مرة)", c: 100, a: "20.mp3"),
    Zekr(
        z: "اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَامُحَمد ﷺ\n\n(عشر مرات)",
        c: 10,
        a: "21.mp3"),
  ];

  List<Zekr> zekrGrouMsaa = [
    Zekr(
        z: " أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\n﴿ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾",
        c: 0,
        a: "1.mp3"),
    Zekr(
        z: " أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\n﴿آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾",
        c: 0,
        a: "1_1.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ هُوَ ٱللَّهُ أَحَدٌ ۝١ ٱللَّهُ ٱلصَّمَدُ ۝٢ لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ ۝٣ وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ ۝٤﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "112.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ۝١ مِن شَرِّ مَا خَلَقَ ۝٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝٣ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ ۝٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ۝٥﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "113.mp3"),
    Zekr(
        z: " بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n\n ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ۝١ مَلِكِ ٱلنَّاسِ ۝٢ إِلَٰهِ ٱلنَّاسِ ۝٣ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ۝٤ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ۝٥ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ۝٦﴾\n\n(ثلاث مرات)",
        c: 3,
        a: "114.mp3"),
    Zekr(
        z: "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
        c: 0,
        a: "2_2.mp3"),
    Zekr(
        z: "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
        c: 0,
        a: "3_3.mp3"),
    Zekr(
        z: " اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
        c: 0,
        a: "4.mp3"),
    Zekr(
        z: "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك\n\n(اربع مرات)",
        c: 4,
        a: "5_5.mp3"),
    Zekr(
        z: "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        c: 0,
        a: "6_6.mp3"),
    Zekr(
        z: "اللَّهمَّ عافِني في بدَني اللَّهمَّ عافِني في سمعي اللَّهمَّ عافِني في بصري لا إلهَ إلَّا أنت، اللَّهمَّ إنِّي أعوذُ بِكَ منَ الكُفْرِ والفقرِ اللَّهمَّ إنِّي أعوذُ بكَ من عذابِ القبرِ لا إلهَ إلَّا أنت\n\n(ثلاث مرات)",
        c: 3,
        a: "7.mp3"),
    Zekr(
        z: "حسبي الله لا إله إلا هو، عليه توكلت وهو رب العرش العظيم\n\n(سبع مرات)",
        c: 7,
        a: "8.mp3"),
    Zekr(
        z: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ استُرْ عَوْرَاتي، وآمِنْ رَوْعَاتي، اللَّهمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، ومِنْ خَلْفي، وَعن يَميني، وعن شِمالي، ومِن فَوْقِي، وأعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحتي",
        c: 0,
        a: "9.mp3"),
    Zekr(
        z: "اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّموَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلِيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءاً، أوْ أجُرَّهُ إلَى مُسْلِمٍ",
        c: 0,
        a: "10.mp3"),
    Zekr(
        z: "بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولا في السَّماءِ وَهوَ السَّميعُ العليمُ\n\n(ثلاث مرات)",
        c: 3,
        a: "11.mp3"),
    Zekr(
        z: "رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد نبيًا\n\n(ثلاث مرات)",
        c: 3,
        a: "12.mp3"),
    Zekr(
        z: "يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
        c: 0,
        a: "13.mp3"),
    Zekr(
        z: "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا",
        c: 0,
        a: "14_14.mp3"),
    Zekr(
        z: "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
        c: 0,
        a: "15_15.mp3"),
    Zekr(z: "سبحان الله وبحمده\n\n(مائة مرة)", c: 100, a: "16.mp3"),
    Zekr(
        z: "لا إلهَ إلاَّ اللَّه وحْدهُ لاَ شَرِيكَ لهُ، لَهُ المُلْكُ، ولَهُ الحمْدُ، وَهُو عَلَى كُلِّ شَيءٍ قَدِيرٌ\n\n(مائة مرة)",
        c: 100,
        a: "17.mp3"),
    Zekr(
        z: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق\n\n(ثلاث مرات)",
        c: 3,
        a: "18_18.mp3"),
    Zekr(z: "أستغفر الله وأتوب إليه\n\n(مائة مرة)", c: 100, a: "20.mp3"),
    Zekr(
        z: "اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَامُحَمد ﷺ\n\n(عشر مرات)",
        c: 10,
        a: "21.mp3"),
  ];
}
